STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Sink/STM32_WPAN/App/pbp_app.c
/**
  ******************************************************************************
  * @file    pbp_app.c
  * @author  MCD Application Team
  * @brief   Public Broadcast Profile Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "pbp_app.h"
#include "main.h"
#include "ble.h"
#include "ble_audio_stack.h"
#include "stm32_seq.h"
#include "codec_mngr.h"
#include "ltv_utils.h"
#include "pbp.h"


/* Private includes ----------------------------------------------------------*/

/* Private typedef -----------------------------------------------------------*/

/* Private defines -----------------------------------------------------------*/
#define CODEC_POOL_SUB_SIZE                     (960u)

/* double buffer, stereo :
 *?480 (max LC3 frame len (48KHz, 10ms)) x 2 (Max Channels Number (stereo)) x 2 (double buffer configuration)
 */
#define PLAY_BUFF_SIZE                          (480*2*2)

#define SOURCE_ID_LIST_SIZE                     (3u)

#define SCAN_INTERVAL                           (0x40) /* Scan Interval (*0.625ms): 40ms */
#define SCAN_WINDOW                             (0x20) /* Scan Window (*0.625ms): 20ms */
#define PA_EVENT_SKIP                           (0u)
#define PA_SYNC_TIMEOUT                         (0x03E8)
#define BROADCAST_CONTROLLER_DELAY              (22000u)
#define BAP_BROADCAST_ENCRYPTION                (0u)
#define BIG_HANDLE                              (0u)
#define BIG_MSE                                 (0u)
#define BIG_SYNC_TIMEOUT                        (0x0190)

#define BLE_AUDIO_DYN_ALLOC_SIZE                (BLE_AUDIO_TOTAL_BUFFER_SIZE(CFG_BLE_NUM_LINK))

/*Memory required for CAP Acceptor Context*/
#define CAP_ACCEPTOR_DYN_ALLOC_SIZE \
        CAP_ACCEPTOR_MEM_TOTAL_BUFFER_SIZE(MAX_CAP_ACCEPTOR_INSTANCES, \
                                           0u, \
                                           0, \
                                           0u, \
                                           0, \
                                           MAX_NUM_USR_SNK_ASE, \
                                           MAX_NUM_USR_SRC_ASE)
/*Memory required for CAP*/
#define CAP_DYN_ALLOC_SIZE      (CAP_ACCEPTOR_DYN_ALLOC_SIZE)

#define BAP_PACS_SRV_DYN_ALLOC_SIZE \
        BAP_PACS_SRV_TOTAL_BUFFER_SIZE(MAX_NUM_PAC_SNK_RECORDS,MAX_NUM_PAC_SRC_RECORDS)

/* Memory required to allocate resource for Broadcast Audio Scan for Scan Delegator*/
#define BAP_BASS_SRV_DYN_ALLOC_SIZE  \
                BAP_BASS_SRV_TOTAL_BUFFER_SIZE(MAX_NUM_SDE_BSRC_INFO,\
                                              MAX_NUM_BIS_PER_BIG,\
                                              MAX_BASS_CODEC_CONFIG_SIZE,\
                                              MAX_BASS_METADATA_SIZE,\
                                              MAX_NUM_BASS_BASE_SUBGROUPS)
/* Memory required to allocate resource for Non-Volatile Memory Management for BAP Services restoration*/
#define BAP_NVM_MGMT_DYN_ALLOC_SIZE  \
              BAP_NVM_MGMT_TOTAL_BUFFER_SIZE(CFG_BLE_NUM_LINK)

#define CODEC_LC3_SESSION_DYN_ALLOC_SIZE CODEC_GET_TOTAL_SESSION_BUFFER_SIZE(CODEC_LC3_NUM_SESSION)

#define CODEC_LC3_ENCODER_DYN_ALLOC_SIZE CODEC_GET_TOTAL_ENCODER_CH_BUFFER_SIZE(CODEC_LC3_NUM_ENCODER_CHANNEL)

#define CODEC_LC3_DECODER_DYN_ALLOC_SIZE CODEC_GET_TOTAL_DECODER_CH_BUFFER_SIZE(CODEC_LC3_NUM_DECODER_CHANNEL)
/* Private macros ------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
PBPAPP_Context_t PBPAPP_Context = {0};
CAP_Config_t PBPAPP_CAP_Config = {0};
BAP_Config_t PBPAPP_BAP_Config = {0};
CCP_Config_t PBPAPP_CCP_Config = {0};
MCP_Config_t PBPAPP_MCP_Config = {0};
VCP_Config_t PBPAPP_VCP_Config = {0};
MICP_Config_t PBPAPP_MICP_Config = {0};
CSIP_Config_t PBPAPP_CSIP_Config = {0};

static uint32_t aCAPMemBuffer[DIVC(CAP_DYN_ALLOC_SIZE,4)];
static uint32_t aPACSSrvMemBuffer[DIVC(BAP_PACS_SRV_DYN_ALLOC_SIZE,4)];
static uint32_t aNvmMgmtMemBuffer[DIVC(BAP_NVM_MGMT_DYN_ALLOC_SIZE,4)];
static uint32_t aBASSSrvMemBuffer[DIVC(BAP_BASS_SRV_DYN_ALLOC_SIZE,4)];
static uint32_t aAudioInitBuffer[BLE_AUDIO_DYN_ALLOC_SIZE];
static BleAudioInit_t BleAudioInit;

#if (CODEC_LC3_NUM_SESSION > 0u)
static uint32_t aLC3SessionMemBuffer[DIVC(CODEC_LC3_SESSION_DYN_ALLOC_SIZE,4)];
#endif /* CODEC_LC3_NUM_SESSION */
#if (CODEC_LC3_NUM_ENCODER_CHANNEL > 0u)
static uint32_t aLC3EncoderMemBuffer[DIVC(CODEC_LC3_ENCODER_DYN_ALLOC_SIZE,4)];
#endif /* CODEC_LC3_NUM_ENCODER_CHANNEL */
#if (CODEC_LC3_NUM_DECODER_CHANNEL > 0u)
static uint32_t aLC3DecoderMemBuffer[DIVC(CODEC_LC3_DECODER_DYN_ALLOC_SIZE,4)];
#endif /* CODEC_LC3_NUM_DECODER_CHANNEL */

uint8_t aCodecPacketsMemory[MAX_PATH_NB][CODEC_POOL_SUB_SIZE];

uint16_t aRecBuff[PLAY_BUFF_SIZE] __attribute__((aligned));


#if (BAP_BROADCAST_ENCRYPTION == 1)
uint32_t aPBPAPP_BroadcastCode[4u] = {0x00000001, 0x00000002, 0x00000003, 0x00000004};
#else /*(BAP_BROADCAST_ENCRYPTION == 1)*/
uint32_t aPBPAPP_BroadcastCode[4u] = {0x00000000, 0x00000000, 0x00000000, 0x00000000};
#endif /*(BAP_BROADCAST_ENCRYPTION == 1)*/

uint32_t aSourceIdList[SOURCE_ID_LIST_SIZE] = {0x000001, 0x000002, 0x000003};
uint8_t CurrentID = 0u;

uint32_t PreferredControllerDelay = 12000u;

/* Private functions prototypes-----------------------------------------------*/
static tBleStatus PBPAPP_Init(CAP_Role_t CAP_Role, BAP_Role_t BAP_Role);
static void CAP_App_Notification(CAP_Notification_Evt_t *pNotification);
static uint8_t PBPAPP_BroadcastSetupAudio(Audio_Role_t role);
static uint8_t PBPAPP_StartBroadcastAudio(Audio_Role_t role);
static void start_audio_source(void);
static void start_audio_sink(void);
/* Exported functions --------------------------------------------------------*/
extern void APP_NotifyToRun(void);

/* Functions Definition ------------------------------------------------------*/
/**
  * @brief  Notify CAP Events
  * @param  pNotification: pointer on notification information
 */
void CAP_Notification(CAP_Notification_Evt_t *pNotification)
{
  /* Notify PBP */
  CAP_PBP_Notification(pNotification);

  /* Notify App */
  CAP_App_Notification(pNotification);
}


/**
  * @brief  Notify PBP Events
  * @param  pNotification: pointer on notification information
 */
void PBP_Notification(PBP_Notification_Evt_t *pNotification)
{
  switch (pNotification->EvtOpcode)
  {
    case PBP_BROADCAST_AUDIO_UP_EVT:
    {
      APP_DBG_MSG(">>== PBP_BROADCAST_AUDIO_UP_EVT\n");
    }
    break;
    case PBP_BROADCAST_AUDIO_DOWN_EVT:
    {
      uint8_t status;
      APP_DBG_MSG(">>== PBP_BROADCAST_AUDIO_DOWN_EVT\n");
      MX_AudioDeInit();

      if (PBPAPP_Context.PASyncState != PBPAPP_PA_SYNC_STATE_IDLE)
      {
        /* Stop Periodic Advertising Sync */
        status = PBP_PBK_StopPASync(PBPAPP_Context.PASyncHandle);
        if (status != BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("  Fail   : PBP_PBK_StopPASync() function, result: 0x%02X\n", status);
        }
        else
        {
          APP_DBG_MSG("  Success: PBP_PBK_StopPASync() function\n");
          PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_IDLE;
        }
      }

      if (PBPAPP_Context.ScanState == PBPAPP_SCAN_STATE_IDLE)
      {
        /* Start Scan */
        status = CAP_Broadcast_StartAdvReportParsing();
        if (status != BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("  Fail   : CAP_Broadcast_StartAdvReportParsing() function, result: 0x%02X\n", status);
        }
        else
        {
          APP_DBG_MSG("  Success: CAP_Broadcast_StartAdvReportParsing() function\n");
        }

