STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Sink/STM32_WPAN/App/pbp_app.c
    case PBP_PBK_BIGINFO_REPORT_EVT:
    {
      if (PBPAPP_Context.BIGSyncState == PBPAPP_BIG_SYNC_STATE_IDLE)
      {
        uint8_t status;
        BAP_BIGInfo_Report_Data_t *data = (BAP_BIGInfo_Report_Data_t *) pNotification->pInfo;
        uint8_t bis_index[2u] = {0x01, 0x02};

        status = PBP_PBK_StartBIGSync(BIG_HANDLE,
                                      data->SyncHandle,
                                      &(bis_index[0]),
                                      data->NumBIS,
                                      &(PBPAPP_Context.base_group),
                                      0u,
                                      BAP_BROADCAST_ENCRYPTION,
                                      aPBPAPP_BroadcastCode,
                                      BIG_MSE,
                                      BIG_SYNC_TIMEOUT);
        if (status != BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("  Fail   : PBP_PBK_StartBIGSync() function, result: 0x%02X\n", status);
        }
        else
        {
          APP_DBG_MSG("  Success: PBP_PBK_StartBIGSync() function\n");
          PBPAPP_Context.BIGSyncState = PBPAPP_BIG_SYNC_STATE_SYNCHRONIZING;
        }
      }
      break;
    }

    case PBP_PBK_BIG_SYNC_ESTABLISHED_EVT:
      {
        tBleStatus ret;
        BAP_BIG_Sync_Established_Data_t *data = (BAP_BIG_Sync_Established_Data_t*) pNotification->pInfo;
        APP_DBG_MSG(">>== PBP_PBK_BIG_SYNC_ESTABLISHED_EVT\n");
        APP_DBG_MSG("     - BIG_Handle = 0x%02x\n",data->BIGHandle);
        APP_DBG_MSG("     - Num BISes = %d\n",data->NumBISes);

        UTIL_MEM_cpy_8(&(PBPAPP_Context.current_BIS_conn_handles[0]),
                       data->pConnHandle,
                       (data->NumBISes * sizeof(uint16_t)));
        PBPAPP_Context.current_num_bis = data->NumBISes;
        PBPAPP_Context.BIGSyncState = PBPAPP_BIG_SYNC_STATE_SYNCHRONIZED;

        ret = CAP_Broadcast_StopAdvReportParsing();
        if (ret != BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("  Fail   : CAP_Broadcast_StopAdvReportParsing() function, result: 0x%02X\n", ret);
        }
        else
        {
          APP_DBG_MSG("  Success: CAP_Broadcast_StopAdvReportParsing() function\n");
        }
        ret = aci_gap_terminate_gap_proc(GAP_OBSERVATION_PROC);
        if (ret != BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("  Fail   : aci_gap_terminate_gap_proc() function, result: 0x%02X\n", ret);
        }
        else
        {
          PBPAPP_Context.ScanState = PBPAPP_SCAN_STATE_IDLE;
          APP_DBG_MSG("  Success: aci_gap_terminate_gap_proc() function\n");
        }
        ret = PBP_PBK_StopPASync(PBPAPP_Context.PASyncHandle);
        if (ret != BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("  Fail   : PBP_PBK_StopPASync() function, result: 0x%02X\n", ret);
        }
        else
        {
          APP_DBG_MSG("  Success: PBP_PBK_StopPASync() function\n");
          PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_IDLE;
        }

        PBPAPP_BroadcastSetupAudio(AUDIO_ROLE_SINK);
      }
      break;

    case PBP_PBK_BIG_SYNC_LOST_EVT:
      {
        APP_DBG_MSG(">>== PBP_PBK_BIG_SYNC_LOST_EVT\n");
        PBPAPP_Context.BIGSyncState = PBPAPP_BIG_SYNC_STATE_IDLE;
      }
      break;

   default:
      break;
  }
  return;
}

/**
  * @brief The BLE Audio Stack requests to be executed. BLE_AUDIO_STACK_Task() shall be called.
  * @note  If the Host task is executed in a separate thread, the thread shall be unlocked here.
  */
void BLE_AUDIO_STACK_NotifyToRun(void)
{
  APP_NotifyToRun();
}

uint8_t PBPAPP_InitSink(void)
{
  uint8_t ret = 0;

  PBPAPP_Context.phy = 0x02;
#if (SETUP_SPEAKER == 1u)
  PBPAPP_Context.audio_driver_config = AUDIO_DRIVER_CONFIG_SPEAKER;
#else
  PBPAPP_Context.audio_driver_config = AUDIO_DRIVER_CONFIG_LINEIN;
#endif /*SETUP_SPEAKER == 1u*/
  PreferredControllerDelay = BROADCAST_CONTROLLER_DELAY;

  APP_DBG_MSG(">>==  Start CAP Acceptor initialization\n");
  ret = PBPAPP_Init(CAP_ROLE_ACCEPTOR, (BAP_ROLE_BROADCAST_SINK | BAP_ROLE_SCAN_DELEGATOR));
    if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : PBPAPP_Init() function, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: PBPAPP_Init() function\n");
  }

  /*Enable Audio Codec in LE Controller */
  PBPAPP_Context.aStandardCodec[0].CodingFormat = AUDIO_CODING_FORMAT_LC3;
  PBPAPP_Context.aStandardCodec[0].TransportMask = 0x01; /*CIS Transport Type only*/
  PBPAPP_Context.AudioCodecInController.NumStandardCodecs = 0x01;
  PBPAPP_Context.AudioCodecInController.pStandardCodec = &PBPAPP_Context.aStandardCodec[0];
  PBPAPP_Context.AudioCodecInController.NumVendorSpecificCodecs = 0x00;
  PBPAPP_Context.AudioCodecInController.pVendorSpecificCodec = (void *)0;

  ret = CAP_EnableAudioCodecController(&PBPAPP_Context.AudioCodecInController);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : CAP_EnableAudioCodecController() function, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: CAP_EnableAudioCodecController() function\n");
  }

  PBPAPP_Context.audio_driver_config = AUDIO_DRIVER_CONFIG_HEADSET;

  ret = PBP_Init(PBP_ROLE_PUBLIC_BROADCAST_SINK);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : PBP_Init() function, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: PBP_Init() function\n");
  }
  APP_DBG_MSG(">>==  End CAP Acceptor initialization\n");
  return ret;
}

uint8_t PBPAPP_StartSink(void)
{
  uint8_t ret;

  APP_DBG_MSG(">>==  Start Sink\n");

  ret = CAP_Broadcast_StartAdvReportParsing();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : CAP_Broadcast_StartAdvReportParsing() function, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: CAP_Broadcast_StartAdvReportParsing() function\n");
  }

  if (ret == BLE_STATUS_SUCCESS)
  {
    /* Starts an Observation procedure */
    ret = aci_gap_start_observation_proc(SCAN_INTERVAL,
                                         SCAN_WINDOW,
                                         0x00,                        /* LE_Scan_Type */
                                         0x00,                        /* Address type: Public */
                                         0x00,                        /* Filter duplicates: No */
                                         0x00 );                      /* Filter policy: Accept all */
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_gap_start_observation_proc() function, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_gap_start_observation_proc() function\n");
      PBPAPP_Context.ScanState = PBPAPP_SCAN_STATE_SCANNING;
    }
  }

  return ret;
}

uint8_t PBPAPP_StopSink(void)
{
  uint8_t ret;

