STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Sink/STM32_WPAN/App/pbp_app.c
  APP_DBG_MSG(">>==  Start Stop Broadcast Sink\n");

  if (PBPAPP_Context.ScanState == PBPAPP_SCAN_STATE_SCANNING)
  {
    ret = aci_gap_terminate_gap_proc(GAP_OBSERVATION_PROC);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_gap_terminate_gap_proc() function, result: 0x%02X\n", ret);
    }
    else
    {
      PBPAPP_Context.ScanState = PBPAPP_SCAN_STATE_IDLE;
      APP_DBG_MSG("  Success: aci_gap_terminate_gap_proc() function\n");
    }
  }

  if (PBPAPP_Context.PASyncState != PBPAPP_PA_SYNC_STATE_IDLE)
  {
    ret = PBP_PBK_StopPASync(PBPAPP_Context.PASyncHandle);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : PBP_PBK_StopPASync() function, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: PBP_PBK_StopPASync() function\n");
      PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_IDLE;
    }
  }

  if (PBPAPP_Context.PASyncState != PBPAPP_PA_SYNC_STATE_IDLE)
  {
    ret = PBP_PBK_StopPASync(PBPAPP_Context.PASyncHandle);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : PBP_PBK_StopPASync() function, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: PBP_PBK_StopPASync() function\n");
      PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_IDLE;
    }
  }

  if (PBPAPP_Context.BIGSyncState != PBPAPP_BIG_SYNC_STATE_IDLE)
  {
    ret = PBP_PBK_StopBIGSync(BIG_HANDLE);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : BP_PBK_StopBIGSync() function, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: BP_PBK_StopBIGSync() function\n");
      PBPAPP_Context.BIGSyncState = PBPAPP_BIG_SYNC_STATE_IDLE;
    }
  }

  APP_DBG_MSG("   >>==  MX_AudioDeInit()\n");
  MX_AudioDeInit();

  APP_DBG_MSG(">>==  End Stop Broadcast Sink\n");

  return ret;
}

void PBPAPP_SwitchBrdSource(uint8_t next, uint32_t *pSourceID)
{
  uint8_t ret;
  APP_DBG_MSG(">>==  Start Switch Broadcast Source\n");

  if (next == 1)
  {
    /* Get next ID */
    CurrentID = (CurrentID + 1) % SOURCE_ID_LIST_SIZE;
  }
  else
  {
    /* Get previous ID */
    CurrentID = (CurrentID + SOURCE_ID_LIST_SIZE - 1) % SOURCE_ID_LIST_SIZE;
  }

  if (PBPAPP_Context.PASyncState != PBPAPP_PA_SYNC_STATE_IDLE)
  {
    ret = PBP_PBK_StopPASync(PBPAPP_Context.PASyncHandle);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : PBP_PBK_StopPASync() function, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: PBP_PBK_StopPASync() function\n");
      PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_IDLE;
    }
  }

  if (PBPAPP_Context.BIGSyncState != PBPAPP_BIG_SYNC_STATE_IDLE)
  {
    ret = PBP_PBK_StopBIGSync(BIG_HANDLE);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : BP_PBK_StopBIGSync() function, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: BP_PBK_StopBIGSync() function\n");
      PBPAPP_Context.BIGSyncState = PBPAPP_BIG_SYNC_STATE_IDLE;
    }
  }

  APP_DBG_MSG("   >>==  MX_AudioDeInit()\n");
  MX_AudioDeInit();

  if (PBPAPP_Context.ScanState == PBPAPP_SCAN_STATE_IDLE)
  {
    ret = CAP_Broadcast_StartAdvReportParsing();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : CAP_Broadcast_StartAdvReportParsing() function, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: CAP_Broadcast_StartAdvReportParsing() function\n");
    }

    if (ret == BLE_STATUS_SUCCESS)
    {
      /* Starts an Observation procedure */
      ret = aci_gap_start_observation_proc(SCAN_INTERVAL,
                                           SCAN_WINDOW,
                                           0x00,              /* LE_Scan_Type */
                                           0x00,              /* Address type: Public */
                                           0x00,              /* Filter duplicates: No */
                                           0x00 );            /* Filter policy: Accept all */
      if (ret != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("  Fail   : aci_gap_start_observation_proc() function, result: 0x%02X\n", ret);
      }
      else
      {
        APP_DBG_MSG("  Success: aci_gap_start_observation_proc() function\n");
        PBPAPP_Context.ScanState = PBPAPP_SCAN_STATE_SCANNING;
      }
    }
  }

  *pSourceID = aSourceIdList[CurrentID];
  APP_DBG_MSG(">>==  End Switch Broadcast Source\n");
}

uint32_t PBPAPP_GetBrdSource(void)
{
  return aSourceIdList[CurrentID];
}

void APP_NotifyRxAudioCplt(uint16_t AudioFrameSize)
{
  UNUSED(AudioFrameSize);
}

void APP_NotifyRxAudioHalfCplt(void)
{

}

void APP_NotifyTxAudioCplt(uint16_t AudioFrameSize)
{
  uint8_t i;

  if (PBPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SINK)
  {
    for (i = 0; i< PBPAPP_Context.current_num_bis; i++)
    {
      CODEC_ReceiveData(PBPAPP_Context.current_BIS_conn_handles[i], 1, &aRecBuff[0]  + AudioFrameSize/2 + i);
    }
  }
}

void APP_NotifyTxAudioHalfCplt(void)
{
  uint8_t i;

  if (PBPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SINK)
  {
    for (i = 0; i< PBPAPP_Context.current_num_bis; i++)
    {
      CODEC_ReceiveData(PBPAPP_Context.current_BIS_conn_handles[i], 1, &aRecBuff[0] + i);
    }
  }
}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
/**
  * @brief  Notify CAP Events for App
  * @param  pNotification: pointer on notification information
 */
static void CAP_App_Notification(CAP_Notification_Evt_t *pNotification)
{
  switch (pNotification->EvtOpcode)
  {
    case CAP_CODEC_CONFIGURED_EVT:
      {
        APP_DBG_MSG(">>== CAP_CODEC_CONFIGURED_EVT\n");
        Sampling_Freq_t *freq = (Sampling_Freq_t *)pNotification->pInfo;
        APP_DBG_MSG("     - Sample Frequency Type:   0x%02X\n",*freq);
        APP_DBG_MSG("==>> Audio Clock with Sample Frequency Type 0x%02X Initialization\n",*freq);
        AudioClock_Init(*freq);
      }
      break;
  }
}

static uint8_t PBPAPP_Init(CAP_Role_t CAP_Role, BAP_Role_t BAP_Role)
{
  tBleStatus ret = 0;
  /* Initialize the Audio IP*/
  BleAudioInit.NumOfLinks = CFG_BLE_NUM_LINK;
  BleAudioInit.bleStartRamAddress = (uint8_t*)aAudioInitBuffer;
  BleAudioInit.total_buffer_size = BLE_AUDIO_DYN_ALLOC_SIZE;
  ret = BLE_AUDIO_STACK_Init(&BleAudioInit);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : BLE_AUDIO_STACK_Init() function, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: BLE_AUDIO_STACK_Init() function\n");
  }
  if(ret == BLE_STATUS_SUCCESS)
  {
    /*Clear the CAP Configuration*/
    memset(&PBPAPP_CAP_Config,0,sizeof(PBPAPP_CAP_Config));

